hpeyerl/esp32p4_vehicle_dashboard/sdkconfig.defaults
# sdkconfig.defaults - M5Stack Tab5 EV Dashboard
# Based on M5Stack UserDemo platforms/tab5/sdkconfig.defaults
# ESP-IDF 5.4.2

CONFIG_IDF_TARGET="esp32p4"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM - 32MB HEX at 200MHz (required to avoid DPI underrun)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Cache - larger L2 cache improves PSRAM DMA bandwidth for DPI
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ESP32-P4 silicon revision (Tab5 v1.3 = ECO2, less than v3)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# TWAI (CAN)
CONFIG_TWAI_ISR_IN_IRAM=y

# I2C
CONFIG_I2C_ISR_IRAM_SAFE=y

# MIPI DSI
CONFIG_LCD_DSI_ISR_CACHE_SAFE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Brownout - lower threshold for USB power without battery
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_0=y
CONFIG_ESP_BROWNOUT_DET_LVL=0

# Disable task watchdog (ST7123 init takes time)
CONFIG_ESP_TASK_WDT_EN=n

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
